FoamCase_singleCube/system/cloudData
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       csv;
fields          (U p);
writeControl    writeTime;
writeInterval   1;

sets
(

	
	cloud1
    {
        type    cloud;
        axis    xyz;
        points
		(
		(	0.6	0	0	)
		(	0.6	0	0.1	)
		(	0.6	0	0.2	)
		(	0.6	0	0.3	)
		(	0.6	0	0.4	)
		(	0.6	0	0.5	)
		(	0.6	0	0.6	)
		(	0.6	0	0.7	)
		(	0.6	0	0.8	)
		(	0.6	0	0.9	)
		(	0.6	0	1	)
		(	0.6	0	1.1	)
		(	0.6	0	1.2	)
		(	0.6	0	1.3	)
		(	0.6	0	1.4	)
		(	0.6	0	1.5	)
		(	0.6	0	1.6	)
		(	0.6	0	1.7	)
		(	0.6	0	1.8	)
		(	0.6	0	1.9	)
		(	0.6	0	2	)
		(	0.6	0	2.1	)
		(	0.6	0	2.2	)
		(	0.6	0	2.3	)
		(	0.6	0	2.4	)
		(	0.6	0	2.5	)
		(	0.75	0	0	)
		(	0.75	0	0.1	)
		(	0.75	0	0.2	)
		(	0.75	0	0.3	)
		(	0.75	0	0.4	)
		(	0.75	0	0.5	)
		(	0.75	0	0.6	)
		(	0.75	0	0.7	)
		(	0.75	0	0.8	)
		(	0.75	0	0.9	)
		(	0.75	0	1	)
		(	0.75	0	1.1	)
		(	0.75	0	1.2	)
		(	0.75	0	1.3	)
		(	0.75	0	1.4	)
		(	0.75	0	1.5	)
		(	0.75	0	1.6	)
		(	0.75	0	1.7	)
		(	0.75	0	1.8	)
		(	0.75	0	1.9	)
		(	0.75	0	2	)
		(	0.75	0	2.1	)
		(	0.75	0	2.2	)
		(	0.75	0	2.3	)
		(	0.75	0	2.4	)
		(	0.75	0	2.5	)
		(	1.25	0	0	)
		(	1.25	0	0.1	)
		(	1.25	0	0.2	)
		(	1.25	0	0.3	)
		(	1.25	0	0.4	)
		(	1.25	0	0.5	)
		(	1.25	0	0.6	)
		(	1.25	0	0.7	)
		(	1.25	0	0.8	)
		(	1.25	0	0.9	)
		(	1.25	0	1	)
		(	1.25	0	1.1	)
		(	1.25	0	1.2	)
		(	1.25	0	1.3	)
		(	1.25	0	1.4	)
		(	1.25	0	1.5	)
		(	1.25	0	1.6	)
		(	1.25	0	1.7	)
		(	1.25	0	1.8	)
		(	1.25	0	1.9	)
		(	1.25	0	2	)
		(	1.25	0	2.1	)
		(	1.25	0	2.2	)
		(	1.25	0	2.3	)
		(	1.25	0	2.4	)
		(	1.25	0	2.5	)
		(	0.6	-0.625	0	)
		(	0.6	-0.625	0.1	)
		(	0.6	-0.625	0.2	)
		(	0.6	-0.625	0.3	)
		(	0.6	-0.625	0.4	)
		(	0.6	-0.625	0.5	)
		(	0.6	-0.625	0.6	)
		(	0.6	-0.625	0.7	)
		(	0.6	-0.625	0.8	)
		(	0.6	-0.625	0.9	)
		(	0.6	-0.625	1	)
		(	0.6	-0.625	1.1	)
		(	0.6	-0.625	1.2	)
		(	0.6	-0.625	1.3	)
		(	0.6	-0.625	1.4	)
		(	0.6	-0.625	1.5	)
		(	0.6	-0.625	1.6	)
		(	0.6	-0.625	1.7	)
		(	0.6	-0.625	1.8	)
		(	0.6	-0.625	1.9	)
		(	0.6	-0.625	2	)
...
		(	1.25	-0.25	2.5	)







		);
    }
	
	
);



// ************************************************************************* //
